//Задание 12
//lab12
#include <iostream>
int main()
{
int x;
scanf("%d", &x);
if (x <= 5)
printf("Увы рабочий день");
else if (x == 6)
printf("Можно и отдохнуть");
else if (x == 7)
printf("Завтра на работу");
}